In [1]:
from sqlalchemy import create_engine
import pandas as pd 
import seaborn as sns
from matplotlib import pyplot as pyplot

In [2]:
database_name = "scooters"
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [26]:
engine = create_engine(connection_string)

In [27]:
query = '''
SELECT *
FROM scooters
LIMIT 100;
''' 
people=pd.read_sql(query, con=engine)

In [28]:
people
#with engine.connect() as connection:
    #people = pd.read_sql(text(query), con = connection)

#people.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird
...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:01:41.247,36.141158,-86.801997,PoweredWDMWW,Powered,69.0,scooter,0.0,Bird
96,2019-05-01 00:01:41.247,36.138786,-86.801667,PoweredSNB79,Powered,88.0,scooter,0.0,Bird
97,2019-05-01 00:01:41.247,36.162634,-86.781603,PoweredM69E2,Powered,91.0,scooter,0.0,Bird
98,2019-05-01 00:01:41.247,36.144795,-86.795576,PoweredHY38F,Powered,88.0,scooter,0.0,Bird
99,2019-05-01 00:01:41.247,36.165809,-86.777780,Powered2WLYW,Powered,98.0,scooter,0.0,Bird

In [53]:
query = '''
SELECT tripduration 
FROM trips
''' 
travel=pd.read_sql(query, con=engine)

In [54]:
travel

        tripduration
0           3.000000
1           1.715600
2           3.000000
3           3.000000
4           2.000000
...              ...
565517     17.497950
565518      3.154917
565519     18.440650
565520    142.345610
565521    209.409650

[565522 rows x 1 columns]

In [50]:
#travel=pd.read_sql

In [55]:
#What is the range of values for trip duration and trip distance?

min_duration, max_duration= travel['tripduration'].min(),travel['tripduration'].max()
#min_distance, max_distance = travel['tripdistance'].min(), travel['tripdistance'].max()
print(f"Duration ranges from {min_duration} to {max_duration}")
#print(f"Distance ranges from {min_distance} to {max_distance}")

Duration ranges from -19.3582666667 to 512619.0